---
kind: other
id: Properties.T:Autodesk.Revit.DB.Settings
source: html/ab0e534a-28d0-38f2-b623-d2a2c42557ec.htm
---
# Settings Properties

Retrieves an object that provides access to all the categories contained in the Autodesk
Revit application and project.